# ------TRIGGER__PY_START------

word = "Some"  # String
number = 7  # Integer
num_2 = 5.68132  # Float
bool = False  # Boolean

word = "Результат:"

number -= 5
x = 8
res = number % x

a = z = q = 10
w, r, b = 12, "Word", True

print(word, res, w, r, b)

age = input("Введите ваш возраст: ")
print("Ваш возраст", age)

# -------HOMEWORK--------

# TODO Нахождение числа Создайте программу, которая будет принимать число (n), введенное пользователем, и выдавать
#  результат в виде (n + n * 2).


# TODO Работа с переменными
#  Создайте переменную со значением 46 и переменную со значением "string". Последнюю переменную умножьте на 5.
#  Выведите на экран обе переменные.


# TODO Простые переменные
#  Создайте переменные со значениями: 5, F, Привет, 90.2.
#  Создайте переменную, которую нельзя будет изменить и установите ей значение 67.
#  Выведите переменную со значением "Привет" на экран.


# TODO Разделение числа на символы
#  Напишите программу, которая будет получать от пользователя число с 4 числами.
#  Реализуйте разделение этого числа на отдельные цифры.
#  Пример:
# Число 5934
# Результат 5, 9, 3, 4


# TODO Получение данных от пользователя
#  Создайте программу, что будет запрашивать данные пользователя: имя, фамилию, возраст и выводить их на экран.


# TODO Математические операции
#  Создайте программу, которая будет запрашивать три переменные у пользователя и после их получения выводить на экран математически операции над ними:
#  сумма
#  вычитание
#  деление
#  умножение
#  остаток при делении